title: DLL Execution via Regsvr32 (Living Off The Land)
id: b79ea1bc-keys-regsvr32
description: Detects regsvr32.exe being used to execute DLLs, especially from non-standard or user-writable locations
status: experimental
author: (@vVv-Keys)
date: 2025/06/19
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\regsvr32.exe'
    CommandLine|contains:
      - '.dll'
      - 'AppData'
      - 'Temp'
      - 'http'
  condition: selection
falsepositives:
  - Developer test environments or rare app installers
level: medium
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - sigma-contrib
